In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
'''Q1. Write a code to print the data present in the second row of the dataframe, df.
'''
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [4]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [5]:
'''Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
'''
'''
-> loc is used for label indexing and can access multiple columns while iloc is used
for integer indexing.
'''

'\n-> loc is used for label indexing and can access multiple columns while iloc is used\nfor integer indexing.\n'

In [6]:
'''Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].
'''
new_df = df.reindex([3,0,1,2])

In [7]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [8]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [9]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [10]:
'''loc gives label indexing hence it gives the data in the row named 2 while
iloc gives the integer indexing hence it gives the data in the row indexed at 2.
'''

'loc gives label indexing hence it gives the data in the row named 2 while\niloc gives the integer indexing hence it gives the data in the row indexed at 2.\n'

In [11]:
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [12]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.081905  0.101971  0.481984  0.543970  0.520104  0.470901
2  0.208994  0.438263  0.785459  0.661613  0.280723  0.968598
3  0.737397  0.934134  0.790298  0.436335  0.649855  0.834544
4  0.378179  0.691005  0.200980  0.202076  0.162747  0.265828
5  0.238327  0.882784  0.067161  0.376655  0.305408  0.604523
6  0.184585  0.011229  0.876376  0.697429  0.531263  0.651834

In [13]:
'''Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’
'''
df1.mean(axis=0)

column_1    0.304898
column_2    0.509898
column_3    0.533710
column_4    0.486346
column_5    0.408350
column_6    0.632704
dtype: float64

In [14]:
df1['column_2'].std()

0.39294465021512004

In [15]:
'''Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
'''
df1.loc[2,"column_2"] = "data science"

In [16]:
df1

   column_1      column_2  column_3  column_4  column_5  column_6
1  0.081905      0.101971  0.481984  0.543970  0.520104  0.470901
2  0.208994  data science  0.785459  0.661613  0.280723  0.968598
3  0.737397      0.934134  0.790298  0.436335  0.649855  0.834544
4  0.378179      0.691005  0.200980  0.202076  0.162747  0.265828
5  0.238327      0.882784  0.067161  0.376655  0.305408  0.604523
6  0.184585      0.011229  0.876376  0.697429  0.531263  0.651834

In [17]:
#df1['column_2'].mean()
#We get an error because the mean for a non numeric data cannot be obtained

In [18]:
'''Q6. What do you understand about the windows function in pandas and list the types of windows
functions?
--> The window functions in pandas are used to perform some sort of calculations across a set of 
rows that are interrelated with the current row.
The types of windows functions are-
Aggregate
Ranking
Value
'''

'Q6. What do you understand about the windows function in pandas and list the types of windows\nfunctions?\n--> The window functions in pandas are used to perform some sort of calculations across a set of \nrows that are interrelated with the current row.\nThe types of windows functions are-\nAggregate\nRanking\nValue\n'

In [19]:
'''Q7. Write a code to print only the current month and year at the time of answering this question.
'''
from datetime import datetime

In [20]:
date = datetime.now()

In [21]:
pd.to_datetime(date).day_name()

'Sunday'

In [22]:
date.year

2023

In [23]:
date = pd.to_datetime(date)

In [24]:
date

Timestamp('2023-07-30 13:34:56.612217')

In [25]:
'''Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.
'''
date1 = pd.to_datetime(input("Enter the first date: "))
date2 = pd.to_datetime(input("Enter the second date: "))

Enter the first date:  2023-01-28
Enter the second date:  2022-11-17

In [26]:
date1

Timestamp('2023-01-28 00:00:00')

In [27]:
date2

Timestamp('2022-11-17 00:00:00')

In [28]:
date1-date2

Timedelta('72 days 00:00:00')